In [2]:
import pandas as pd

In [6]:
dic= {'Name': ['Vinay', 'Kushal', 'Aman'],
    'Age' : [22, 25, 24],
    'Occupation' : ['engineer', 'doctor', 'accountant']}
dic

{'Name': ['Vinay', 'Kushal', 'Aman'],
 'Age': [22, 25, 24],
 'Occupation': ['engineer', 'doctor', 'accountant']}

In [7]:
df = pd.DataFrame(dic)

In [8]:
df

     Name  Age  Occupation
0   Vinay   22    engineer
1  Kushal   25      doctor
2    Aman   24  accountant